#ნომერი პირველი) რს არის ცვლადი-კოდირების ერთ-ერთი ყველაზე მნიშვნელოვანი ცნება არის ცვლადი.
#ცვლადი არის მონაცემთა ნაწილის სახელი, რომელიც შეიძლება შეიცვალოს. დასამახსოვრებლად მარტივი
#გზაა ის, რომ ცვლადი შეიძლება განსხვავდებოდეს ან შეიცვალოს მნიშვნელობა. არის უამრავი
#მნიშვნელოვანი ინფორმაცია რომელიც ცვლის მნიშვნელობას. მაგ: ასაკი,ამინდი ან დღევანდელი თარიღი
#ცვლადი რომ შევქმნათ უნდა დავწერთ მაგალიად first_name=("beso") ან age=(15) და სხვა. ცვლადი
#ასე შეგვიძლია დავახასიათოდ-იგი ჰგავს ყუთს,სადაც ვინახავთ ინფორმაციას, ხოლო რომ დავიმახსოვროთ
#თუ რა ჩავდეთ ყუთში ჩვენ უნდა დავასახელოთ ყუთი. ხოლო როცა დაგვჭირდება ინფორმაცია,ცჩვენ
#შეგვიძლია გავხსნათ ყუთი და ამოვიღოთ რაც ინახება შიგნით. ასევე შეგვიძლია შევცვალოთ ყუთში არსებული
#ნივთი მარა შევინახოთ იგივე მნიშვნელობით.