number1=39
number2=7
print(number1+number2)
print(number1-number2)
print(number1*number2)
print(number1/number2)
print(number1%number2)
print(number1**number2)
print(number1//number2)


#პროგრამირებაში % (პროცენტი) დახმარებით ჩვენ ვასრულებთ ნაშთიან გაყოფა
#// (ორი გაყოფა)-ის დახმარებით ჩვენ ვასრულებთ მხოლოდ მთელ გაყოფას, ანუ გაყოფილი რიცხვიდან
#მხოლოდ მთელი რიცხვი გამოგვაქვს (თუ ათწილად რიცხვს მივიღებთ //-ის დროს კომპიუტერი
#მხოლოდ მთელ რიცხვს ა,ოიყვანს პასუხად და ათწილადს წაშლის)
#** (ორი გამრავლება)-ის დროს ჩვენ რიცხვი ხარისხში აგვყავს