number1=14
number2=9
print(number1/number2)
print(number1//number2)
print(number1%number2)


#როცა მე 14 9-ზე გავყავი ერთიანი გაყოფით (/) მე პასუხად ათწილადი მივიღე. მაგრამ შემედძლო
#ასევე მიმეღო რაიმე მეთელი რიცხვი რადგან ერთიანი გაყოფით მე ზუსტი გაყოფა სადაც პასუხად ან
#ათწილად ან მთელ რიცხვს ვიღებ

#როცა მე 14 9-ზე გავყავი ორმაგი გაყოფით (//) მე პასუხად მხოლოდ ათწილადი რიცხვი მივიღ რადგან
# ორმაგი გაყოფით ჩვენ მთელ გაყოფას ვასრულებთ სადაც კომპიუტერს პასუხად გამოაქვს მხოლოდ
#მთელი რიცხვები

#როცა მე 14 9-ზე პგავყავი პროცენტის (%) ნიშნით გავყავი მე პასუხად ნაშთი მივიღ რადგან
# % პროგრამირებაში ნაშთიან გაყოფას ნიშნავს